const n={},l=`<h2>我的前端路分享</h2>
<br>
<p>题记: 原来你想做成一件事, 你要克服很多困难, 而最大的困难就是自己......</p>
<br>
<ul>
<li>初始阶段</li>
</ul>
<br>
<p>19年, 是我大学的最后一年, 也是最迷茫的一年, 这一年我感觉事情好多的, 起先是父亲的意外事故导致自身无法正常站立行走,
高昂的医药费用也迫使家里有所花费, 当然只要能帮父亲站起来, 怎么样都挺值得, 那一段日子, 我没有任何一次像那天那样,那么的想要去赚钱, 但是我怎么赚呢? 我会什么? 餐厅做过临时工, 服务员, 工厂也进过电子厂;但同样我还面临着另外的一个选择, 就是当时所处的学历环境, 要么升学接着往下读, 要么就干自身学的技术, 这两件事成为了我的毕业选择, 但那个时候我只想着逃避,于是那一段时间把自己搞得很累, 一边看高数, 一边继续学前端---因为 18 年的一个上午因为偶然的机会老师建议将来从事后端, 至于这件事,后面再讲, 拖泥带水的到了临近考试的前一个月, 我做出了选择, 不想再这样两头兼顾, 因为根据当时学习的状况, 以及自身的投入时间, 充其量也只能是个一百多分(满分 300 高数 150, 英语 150), 鱼和熊掌不可兼得, 于是毅然赌上一把, 用技术去找工作.</p>
<br>
<ul>
<li>无知阶段</li>
</ul>
<br>
<p>18 年下学期是大三的上半学期, 我们接触了一门课程叫 <span class='keyword'>JavaWeb SpringBoot开发</span>, 起初我没有对这门课程有多大兴趣, 认为还是努力学学不会系列, 于是乎老师念着念着 ppt, 也把我念到了周公那里, 循环往复的每天,
但不知为何老师讲到这门课突然讲起了代码, 我也顺带的跟着做打开了编辑器, 望着 springboot 的 web 交互代码, 我在看, 我去, 这个代码好像我能看懂了, 起码知道它在看什么, 后来我才知道, 原来一个 好的 Web 框架给你的第一眼都是这样,就这样我开始每节课, 都开始跟着学了, 虽然到最后 springboot 的分层概念我还是没理解透彻, 但这个概念印在了我的脑海里, 但私说还是因为大学毕业要写毕业设计, 总不能什么都不会, 毕竟计算机这行也学了近五年, 虽然在编码这里还是个门外汉, 始终入不了门, 但 spring boot 给了我一个希望, 给了我一个火种, 在以后的每节课, 同学们只要有啥不会的, 我都主动去帮他们修 bug, 改问题,用自己的 --方式--解决, 现在想想, 哇塞当年我也好坑啊; 老师见我如此用劲学, 建议我升学好好再学 java 课程,将来找一个好的后端工作, 后端? 后端是什么? 当时我是真的不明白, 后来去网上一搜, 不仅有后端也有前端, 还有数据, 一窝蜂的互联网职业扑面而来, 那一刻起, 灵魂肿的跟麻瓜一样, 反省这五年自己都干了些什么, 为什么不早点去网上搜这些课程, 不早点去网上学, 不早点去试试, 为什么不早点醒悟, 一阵一阵的失落感如雨滴而下, 我竟然不会去网上找资料,于是 18 年那个 12 月我是终身难忘的,我在淘宝花了 28.5 元买了前端的课程, 为什么不接着学后端呢? 当时发现我对后端一是不感兴趣, 二是时间紧迫要抓简单的感觉学,赶紧入门, 前端也不咋简单......</p>
<br>
<ul>
<li>前端伊始</li>
</ul>
<br>
<p>时间推送到 18 年的最后一个寒假, 我给了自己足足一个月的时间,每天近乎疯狂的学习, 每天死磕看视频 6 小时, 看完就跟着练,
不会的就自己晚上想, 晚上一遍遍的脑海里面悟, 这样一个月的时间磨过去了, 开学时, 大家纷纷选了毕业导师,领了毕业设计的命题,
有的网上百度, 有的网上买论文,买项目, 只有我一点点自己写, 因为当时理解那些概念的时候我的毕业论文及项目我是有能力可以做出来的, 毕竟也不复杂, 就是一个 留言的管理系统, 不到两周这个项目加上论文已经初版, 剩下的时间就是边等老师看, 边学专升本的知识, 边学前端的课程, 那时候前端还没有学的那么深.</p>
<br>
<ul>
<li>如梦一场</li>
</ul>
<br>
<p>转眼毕业, 那时,专生本的考试也已经参加并且已经结束, 来到家里, 面对的就是家人所说的去找一个工作, 于是开始在家那边市里开始投简历, 但是似乎机会渺茫, 当然也有面试的经历,但大多不愿招刚毕业的大学生及一个刚入门的新人, 于是那一段时间去了临时的厂所上班, 工作内容就是挑一些电池壳子, 不符合的调出来就行, 还要量长度,就这些, 一个月就几百块钱, 挑一箱才十块钱, 一天能调四箱我感觉就是很厉害的人, 可能我挑的慢吧......两个月后一位老同学的电话,打到我这里, 说他工作室招前端,工作内容就是写外包的页面, 我一听很欢喜, 我立马跟领导交代了一下第二天就去找他了,因为离得也不太远坐公交就能去, 但是进到那个工作室, 其实算上我也就仨人, 我也没想那么多,毕竟已经一脚踩进来这个房间里面了,那个朋友设计出身,在深圳呆过两年, 会一些前端的技术, 起初我的技术水平仅限于写写页面, 用JS 写一写交互的效果, 虽然说三个人,但是另一位是不折不扣的前端, 我叫她华姐, 他是培训班学出来的,由于家庭原因所以就留在了市里没出来找工作, 但是她的水平也很不错, 就这样这个工作室干了两个月之后,由于一些原因维持不下去, 我选择了离开.</p>
  <br>
<p>回到了家中那时已经是寒冬十一月, 再去找工作也是不太可能,没办法, 但是亲戚朋友点子多, 小姑那时给了我打电话,说让去她工作的食品厂工作, 我想着,那里累一点毕竟工资高, 我这么大了,毕竟还是那个男的那么挑挑剔剔干什么, 于是就去了, 进到招聘室,由于小姑的走关系操作,我被分配到她的车间, 不过不在一个车间, 起初就是搬运成品食品箱摆到架子上, 这样持续了三天, 因为是新人, 什么活都要尝试干一些, 于是第四天我跟着那个胖的大姐去学给箱子上喷码,喷上食品的生产日期, 在喷的过程中, 因为车间太过干燥, 喷码的工作是我扶着纸箱, 由于不断的摩擦,手指划破了出血, 我不忍血滴到箱子上,于是赶紧去洗手间洗了一下手指, 但是这个胖大姐却说我偷懒,天天耍滑,我当时都崩溃了,我平生第一次被别人说偷奸耍滑,第五天干完直接跑路,见到小姑时, 小姑也是很不待见我,说我没干几天就走了,招呼也不打,我很想解释其中个别原因, 但是我也不想解释.因为那个车间总是以开玩笑的说法说我大学生来干这个, 以及那个胖大姐三番五次说我偷懒,在食品厂的那一周心灰意冷, 真的感觉自己的知识都白学了.</p>
  <br>
<ul>
<li>辗转反侧</li>
</ul>
  <br>
<p>老爹知道我这孩子心气高, 傲气, 什么的, 让我去了他工作的厂里,干了一个轻活,就是给电池封口,就是拿着刚打上电液的电池放在机器上, 那个机器像个左轮手枪的轮盘, 我的工作就是将这些电池放在这个孔里面,这个机器转一些,我就放一颗电池进去, 右手放, 左手拿出摆盒子摆好,就这样干到了年初,本想着年初去找工作但是却等来了新冠肺炎,在家呆到了三月份,又去厂里干起了这个活,但是每一回都不是心甘情愿的去,总有被逼被推搡的感觉,于是找父母, 跟父母说我还是想干我这一行, 我想出去找工作,但是父母不相信我能找到这一行的工作,一听我出去,总而言之是一番冷水花泼了我一头,我也理解,毕竟程序员这个工作不常见在我们那里,甚至很多人都不知道这是什么,我跟父母说,我想出去, 我需要拿 5000 元,一是到外地租房子开始找工作及平常的饭费,但是父母不愿给这个钱,说 5000 元我可以给你,但是你找不到怎么办?那这 5000 元不就打水漂了吗?于是告一段落,我为了凑够这 5000 块钱, 我给了在厂里打工的老同学, 我问你们那还要人吗? (他的工作是厂里卸大型机器零件,是个正儿八经的体力活),第一天跟我说要,第二天又说不要,没办法,我妈又跟我说了一个人,就是我大爷(大伯)家的哥哥,他在江苏厂里工作, 一个月能拿到五千多呢,我一听我就给他打了电话,他说他工厂要人,于是我拿上了江苏的车票,第二天就奔了江苏去,漫长的火车......</p>
  <br>
<ul>
<li>江苏之行</li>
</ul>
  <br>
<p>那已是 20 年, 到了江苏的那个目的地,工作是进入车间将一卷卷的铁皮用机器打成一个个的电池壳子, 每人要看四五台机器(熟练的情况下),因为是机械的车间,机油,油烟,这些简直是太过常见,工作内容就是将机器打好的壳子收起放入指定的篮子里面, 一天过去,再将篮子称重并放入到后面摆放规矩, 我觉的里面最难受的活就是,去拍打机器打好壳子出来的废料, 因为一张铁皮, 机器是左右摇摆打, 出来的都是剩下空子的铁皮,它会在机器后面越来越高,你需要拿铲子拍打撵平,稍微不注意或者倒霉那倒立的铁刺就会扎穿的鞋子,跟脚底板来一个亲密的深入接触;</p>
  <br>
<p>又到一年寒冬, 那时候我感觉江苏的冬天真的刺骨的冷, 我穿着单薄油腻的工作服,里面只穿了一个拼多多十几块钱买的保暖衣😂,走进了车间,元月份的天气是真的冷,尤其是六点半你就要起来,开始继续你的 12 小时工作制, 但是我心中的一丝丝温暖就是最后拿着钱去找我喜欢的职业,于是年终到头,公司结了这半年的工资, 我将资金只留下 5000 元,剩下的交给了家里.(因为家里也需要钱, 装修什么的都需要花费, 但是我只要 5000 块[倔强])</p>
  <br>
<ul>
<li>新年结束</li>
</ul>
  <br>
<p>21 年 2 月底,我买了上海的火车票,踏上了找工作之旅,生活到了直至今天....</p>
  <br>
<ul>
<li>鸣谢:</li>
</ul>
  <br>
<pre><code>🏷 Ronn, 我的大学同学, 在他的帮助下,我在上海有了住处,有了找工作的底气 /抱拳/抱拳/抱拳
🏷 小姑, 不是外甥不争气,奈何生活及人所逼,来不及说再见, 希望能原谅
🏷 老爸老妈, 儿子懂得您们一直为我好,但是我还是喜欢自己处理自己喜欢的事情
🏷 食品厂胖大姐: 谢谢你的针锋相对,让我懂得生活不易,一个新人来到社会第一天就被扇了一巴掌;铭记.
🏷 丰丰: 感谢阅读,挑出来了错别字及不通顺的地方.
</code></pre>
`;export{n as attributes,l as html};
